aaa-automation-tests/src/test/resources/uploadingfiles/xmlParser/CompraterRequest_YesFlag.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
     <s:Header>
      <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
         <wsse:UsernameToken>
            <wsse:Username>soa_user</wsse:Username>
            <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">soa_user</wsse:Password>
         </wsse:UsernameToken>
      </wsse:Security>
   </s:Header>
   <s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
      <RatePolicyRequest xmlns="http://exigenservices.com/ipb/policy/integration">
         <ApplicationContext>
            <userId xmlns="http://www.aaancnuit.com.AAANCNU_Common_version2">PLRATING</userId>
            <transactionType xmlns="http://www.aaancnuit.com.AAANCNU_Common_version2">DEV</transactionType>
            <application xmlns="http://www.aaancnuit.com.AAANCNU_Common_version2">PLRATING</application>
            <subSystem xmlns="http://www.aaancnuit.com.AAANCNU_Common_version2">PAS</subSystem>
            <address xmlns="http://www.aaancnuit.com.AAANCNU_Common_version2">addr</address>
            <correlationId xmlns="http://www.aaancnuit.com.AAANCNU_Common_version2">corID</correlationId>
         </ApplicationContext>
         <Policy>
            <Policy>
               <AAACSAAutoPolicy xmlns="http://exigeninsurance.com/eis/product/schema/AAA_SS/1.0">
                  <AAADriver oid="1">
                     <AAADriverRatingInfo>
                        <distantStudentInd>false</distantStudentInd>
                        <newDriverInd>false</newDriverInd>
                        <travelinkDiscount>false</travelinkDiscount>
                     </AAADriverRatingInfo>
                     <AAADrivingLicense>
                        <licensedDt>1999-01-07T00:00:00</licensedDt>
                        <licenseStatusCd>LICUS</licenseStatusCd>
                        <stateProvCd>MD</stateProvCd>
                     </AAADrivingLicense>
                     <age>31</age>
                     <birthDate>1982-10-07T00:00:00</birthDate>
                     <driverBaseDt>2014-02-26T00:00:00</driverBaseDt>
                     <driverRelToApplicantCd>IN</driverRelToApplicantCd>
                     <driverTypeCd>afr</driverTypeCd>
                     <employeeBenefitType>NONE</employeeBenefitType>
                     <financialResponsibilityInd>false</financialResponsibilityInd>
                     <firstLicenseAge>16</firstLicenseAge>
                     <firstName>Grant</firstName>
                     <genderCd>male</genderCd>
                     <insuredOid>1</insuredOid>
                     <lastName>Kelly</lastName>
                     <maritalStatusCd>M</maritalStatusCd>
                     <occupationTypeCd>Employed</occupationTypeCd>
                     <seqNo>1</seqNo>
                  </AAADriver>
                  <AAADriver oid="2">
                     <AAADriverRatingInfo>
                        <distantStudentInd>false</distantStudentInd>
                        <newDriverInd>false</newDriverInd>
                        <travelinkDiscount>false</travelinkDiscount>
                     </AAADriverRatingInfo>
                     <AAADrivingLicense>
                        <licensedDt>1999-04-14T00:00:00</licensedDt>
                        <licenseStatusCd>LICUS</licenseStatusCd>
                        <stateProvCd>MD</stateProvCd>
                     </AAADrivingLicense>
                     <age>31</age>
                     <birthDate>1983-01-14T00:00:00</birthDate>
                     <driverBaseDt>2014-02-26T00:00:00</driverBaseDt>
                     <driverRelToApplicantCd>SP</driverRelToApplicantCd>
                     <driverTypeCd>afr</driverTypeCd>
                     <employeeBenefitType>NONE</employeeBenefitType>
                     <financialResponsibilityInd>false</financialResponsibilityInd>
                     <firstLicenseAge>16</firstLicenseAge>
                     <firstName>Sunil</firstName>
                     <genderCd>male</genderCd>
                     <lastName>Gupta</lastName>
                     <maritalStatusCd>M</maritalStatusCd>
                     <occupationTypeCd>Employed</occupationTypeCd>
                     <seqNo>2</seqNo>
                  </AAADriver>
                  <AAAInsured oid="1">
                     <AAAInsuredMailingAddress>
                        <addressLine1>22205 Greenspring Ave</addressLine1>
                        <city>Lutherville Timonium</city>
                        <countryCd>US</countryCd>
                        <postalCode>21093</postalCode>
                        <stateProvCd>MD</stateProvCd>
                        <usageType>mailing</usageType>
                     </AAAInsuredMailingAddress>
                     <AAAInsuredPrimaryAddress>
                        <addressLine1>22205 Greenspring Ave</addressLine1>
                        <city>Lutherville Timonium</city>
                        <countryCd>US</countryCd>
                        <postalCode>21093</postalCode>
                        <stateProvCd>MD</stateProvCd>
                        <usageType>living</usageType>
                     </AAAInsuredPrimaryAddress>
                     <AAAInsuredPriorAddress>
                        <addressLine1>60 Murdock Road</addressLine1>
                        <city>BALTIMORE</city>
                        <countryCd>US</countryCd>
                        <postalCode>21212</postalCode>
                        <stateProvCd>MD</stateProvCd>
                        <usageType>prior</usageType>
                     </AAAInsuredPriorAddress>
                     <communicationInfo.phoneNumber1>4433709763</communicationInfo.phoneNumber1>
                     <dateOfBirth>1982-10-07T00:00:00</dateOfBirth>
                     <differentAddressInd>false</differentAddressInd>
                     <firstName>Grant</firstName>
                     <gender>male</gender>
                     <insuredBaseDt>2014-02-26T00:00:00</insuredBaseDt>
                     <lastName>Kelly</lastName>
                     <maritalStatusCd>M</maritalStatusCd>
                     <principalRoleCd>policyHolder</principalRoleCd>
                     <residentTypeCd>OWNHME</residentTypeCd>
                     <hasLivedHereInd>true</hasLivedHereInd>
                     <moveInDt>2014-02-26T00:00:00</moveInDt>
                  </AAAInsured>
                  <AAAPaymentOption>
                     <paymentPlanCd>standartSS</paymentPlanCd>
                  </AAAPaymentOption>
                  <AAAMPCoverage>
                     <limitAmount>0</limitAmount>
                     <coverageCd>MEDPM</coverageCd>
                  </AAAMPCoverage>
                  <AAAPDCoverage>
                     <limitAmount>100000</limitAmount>
                     <coverageCd>PD</coverageCd>
                  </AAAPDCoverage>
                  <AAAUMBICoverage>
                     <combinedLimitAmount>100000/300000</combinedLimitAmount>
                     <coverageCd>UMBI</coverageCd>
                  </AAAUMBICoverage>
                  <AAAUMPDCoverage>
                     <limitAmount>100000</limitAmount>
                     <coverageCd>UMPD</coverageCd>
                  </AAAUMPDCoverage>
                  <AAAPIPCoverage>
                     <coverageCd>PIP</coverageCd>
                     <combinedLimitAmount>2501</combinedLimitAmount>
                  </AAAPIPCoverage>
                  <AAAVehicle oid="1">
                     <AAACOLLCoverage>
                        <coverageCd>COLLDED</coverageCd>
                        <deductibleAmount>1000</deductibleAmount>
                     </AAACOLLCoverage>
                     <AAACOMPCoverage>
                        <coverageCd>COMPDED</coverageCd>
                        <deductibleAmount>500</deductibleAmount>
                     </AAACOMPCoverage>
                     <AAAGaragingAddress>
                        <addressLine1>11105 Greenspring Ave</addressLine1>
                        <city>Lutherville Timonium</city>
                        <countryCd>US</countryCd>
                        <postalCode>21093</postalCode>
                        <residentialAddressInd>false</residentialAddressInd>
                        <stateProvCd>MD</stateProvCd>
                     </AAAGaragingAddress>
                     <AAARentalReimbursementCoverage>
                        <combinedLimitAmount>40/1200</combinedLimitAmount>
                        <coverageCd>RREIM</coverageCd>
                     </AAARentalReimbursementCoverage>
                     <AAASpecialEquipmentCoverage>
                        <limitAmount>1500</limitAmount>
                        <coverageCd>SPECEQUIP</coverageCd>
                     </AAASpecialEquipmentCoverage>
                     <AAATowingAndLaborCoverage>
                        <coverageCd>TOWINGLABOR</coverageCd>
                        <combinedLimitAmount>50/300</combinedLimitAmount>
                     </AAATowingAndLaborCoverage>
                     <AAAVehicleCoveragePIP>
                        <coverageCd>PIP</coverageCd>
                        <combinedLimitAmount>2501</combinedLimitAmount>
                     </AAAVehicleCoveragePIP>
                     <AAAVehicleCoverageBI>
                        <combinedLimitAmount>100000/300000</combinedLimitAmount>
                        <coverageCd>BI</coverageCd>
                     </AAAVehicleCoverageBI>
                     <AAAVehicleCoverageMP>
                        <coverageCd>MEDPM</coverageCd>
                        <limitAmount>0</limitAmount>
                     </AAAVehicleCoverageMP>
                     <AAAVehicleCoveragePD>
                        <coverageCd>PD</coverageCd>
                        <limitAmount>100000</limitAmount>
                     </AAAVehicleCoveragePD>
                     <AAAVehicleCoverageUMBI>
                        <combinedLimitAmount>100000/300000</combinedLimitAmount>
                        <coverageCd>UMBI</coverageCd>
                     </AAAVehicleCoverageUMBI>
                     <AAAVehicleCoverageUMPD>
                        <coverLevelCd>UMPD</coverLevelCd>
                        <limitAmount>100000</limitAmount>
                     </AAAVehicleCoverageUMPD>
                     <AAAVehicleRatingInfo>
                        <declaredAnnualmiles>20000</declaredAnnualmiles>
                        <distanceOneWayToWork>30</distanceOneWayToWork>
                        <numDaysDrivenPerWeek>5</numDaysDrivenPerWeek>
                        <odometerReading>0</odometerReading>
                        <vehicleUsageCd>WorkCommute</vehicleUsageCd>
                        <waivedLiabilityInd>false</waivedLiabilityInd>
                        <fullGlassCoverageInd>false</fullGlassCoverageInd>
                        <newCarProtectionInd>false</newCarProtectionInd>
                     </AAAVehicleRatingInfo>
                     <airBagStatusCd>0007</airBagStatusCd>
                     <antitheft>NONE</antitheft>
                     <manufacturer>BMW</manufacturer>
                     <model>X3 3.0SI AWD</model>
                     <modelYear>2007</modelYear>
                     <ownershipTypeCd>OWN</ownershipTypeCd>
                     <principalDriverOID>1</principalDriverOID>
                     <seqNo>1</seqNo>
                     <vehIdentificationNo>WBXPC93497WF06366</vehIdentificationNo>
                     <vehTypeCd>PPA</vehTypeCd>
                     <vinMatchedInd>true</vinMatchedInd>
                  </AAAVehicle>
                  <AAAVehicle oid="2">
                     <AAACOLLCoverage>
                        <coverageCd>COLLDED</coverageCd>
                        <deductibleAmount>1000</deductibleAmount>
                     </AAACOLLCoverage>
                     <AAACOMPCoverage>
                        <coverageCd>COMPDED</coverageCd>
                        <deductibleAmount>500</deductibleAmount>
                     </AAACOMPCoverage>
                     <AAAGaragingAddress>
                        <addressLine1>22205 Greenspring Ave</addressLine1>
                        <city>Lutherville Timonium</city>
                        <countryCd>US</countryCd>
                        <postalCode>21093</postalCode>
                        <residentialAddressInd>false</residentialAddressInd>
                        <stateProvCd>MD</stateProvCd>
                     </AAAGaragingAddress>
                     <AAARentalReimbursementCoverage>
                        <combinedLimitAmount>40/1200</combinedLimitAmount>
                        <coverageCd>RREIM</coverageCd>
                     </AAARentalReimbursementCoverage>
                     <AAASpecialEquipmentCoverage>
                        <limitAmount>1500</limitAmount>
                        <coverageCd>SPECEQUIP</coverageCd>
                     </AAASpecialEquipmentCoverage>
                     <AAATowingAndLaborCoverage>
                        <coverageCd>TOWINGLABOR</coverageCd>
                        <combinedLimitAmount>50/300</combinedLimitAmount>
                     </AAATowingAndLaborCoverage>
                     <AAAVehicleCoveragePIP>
                        <coverageCd>PIP</coverageCd>
                        <combinedLimitAmount>2501</combinedLimitAmount>
                     </AAAVehicleCoveragePIP>
                     <AAAVehicleCoverageBI>
                        <combinedLimitAmount>100000/300000</combinedLimitAmount>
                        <coverageCd>BI</coverageCd>
                     </AAAVehicleCoverageBI>
                     <AAAVehicleCoverageMP>
                        <coverageCd>MEDPM</coverageCd>
                        <limitAmount>0</limitAmount>
                     </AAAVehicleCoverageMP>
                     <AAAVehicleCoveragePD>
                        <coverageCd>PD</coverageCd>
                        <limitAmount>100000</limitAmount>
                     </AAAVehicleCoveragePD>
                     <AAAVehicleCoverageUMBI>
                        <combinedLimitAmount>100000/300000</combinedLimitAmount>
                        <coverageCd>UMBI</coverageCd>
                     </AAAVehicleCoverageUMBI>
                     <AAAVehicleCoverageUMPD>
                        <coverLevelCd>UMPD</coverLevelCd>
                        <limitAmount>100000</limitAmount>
                     </AAAVehicleCoverageUMPD>
                     <AAAVehicleRatingInfo>
                        <declaredAnnualmiles>15000</declaredAnnualmiles>
                        <distanceOneWayToWork>5</distanceOneWayToWork>
                        <numDaysDrivenPerWeek>5</numDaysDrivenPerWeek>
                        <odometerReading>0</odometerReading>
                        <vehicleUsageCd>WorkCommute</vehicleUsageCd>
                        <waivedLiabilityInd>false</waivedLiabilityInd>
                        <fullGlassCoverageInd>false</fullGlassCoverageInd>
                        <newCarProtectionInd>false</newCarProtectionInd>
                     </AAAVehicleRatingInfo>
                     <airBagStatusCd>0005</airBagStatusCd>
                     <antitheft>NONE</antitheft>
                     <manufacturer>MINI COOPER</manufacturer>
                     <model>COOPER</model>
                     <modelYear>2013</modelYear>
                     <ownershipTypeCd>OWN</ownershipTypeCd>
                     <principalDriverOID>2</principalDriverOID>
                     <seqNo>2</seqNo>
                     <vehIdentificationNo>WMWSY1C59DT429251</vehIdentificationNo>
                     <vehTypeCd>PPA</vehTypeCd>
                     <vinMatchedInd>true</vinMatchedInd>
                  </AAAVehicle>
                  <agencyCd>500016292</agencyCd>
                  <BICoverage>
                     <combinedLimitAmount>100000/300000</combinedLimitAmount>
                     <coverageCd>BI</coverageCd>
                  </BICoverage>
                  <Commissions>
                     <commissionTypeCd>NB</commissionTypeCd>
                  </Commissions>
                  <effective>2018-08-01T00:00:00</effective>
                  <contractTermTypeCd>AN</contractTermTypeCd>
                  <expiration>2019-04-26T00:00:00</expiration>
                  <importedFrom>PLRATE</importedFrom>
                  <agentCd>500017465</agentCd>
                  <OtherOrPriorPolicy>
                     <insurerCd>No</insurerCd>
                     <productCd>membership</productCd>
                  </OtherOrPriorPolicy>
                  <OtherOrPriorPolicy>
                     <insurerCd>yes</insurerCd>
                     <productCd>home</productCd>
                     <policyNumber>0</policyNumber>
                  </OtherOrPriorPolicy>
                  <AAAOtherOrPriorPolicy>
                     <continuousMonthsInsured>true</continuousMonthsInsured>
                     <insurerCd>900</insurerCd>
                     <insurerName>Erie</insurerName>
                     <monthsWithInsurer>60</monthsWithInsurer>
                     <policyExpDate>2014-03-18T00:00:00</policyExpDate>
                     <priorBILimits>300000/500000</priorBILimits>
                  </AAAOtherOrPriorPolicy>
                  <contractDisplay>12</contractDisplay>
                  <imported>NEW</imported>
                  <producerCd>500016292</producerCd>
                  <productCd>AAA_SS</productCd>
                  <riskStateCd>MD</riskStateCd>
                  <subProducerCd>500017465</subProducerCd>
                  <leadSourceCd>4</leadSourceCd>
                  <orderCreditScore>true</orderCreditScore>
				  <enhancedUIM>true</enhancedUIM>
               </AAACSAAutoPolicy>
            </Policy>
         </Policy>
      </RatePolicyRequest>
   </s:Body>
</s:Envelope>